# Normalisation

In [1]:
import numpy as np
import pandas as pd

### Churn_Modelling

In [5]:
df=pd.read_csv("C:\\Users\\HARSHITA\\Downloads\\Data_sets\\Churn_Modelling - Churn_Modelling.csv")
df.head(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1

In [7]:
df=df.drop(columns=['Surname','Geography'])

In [8]:
df['Gender']=df['Gender'].map({'Female':1,'Male':0})

In [9]:
df.head(3)

,RowNumber,CustomerId,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,619,1,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,608,1,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,502,1,42,8,159660.80,3,1,0,113931.57,1

In [10]:
df.isnull().sum()

RowNumber          0
CustomerId         0
CreditScore        0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
x=df.drop(columns=['Exited'])
y=df['Exited']

In [13]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [14]:
from sklearn.preprocessing import MinMaxScaler

In [15]:
mn=MinMaxScaler()

In [16]:
x_train_mn=mn.fit_transform(x_train)

In [18]:
x_train_new=pd.DataFrame(x_train_mn,columns=x_train.columns)

In [19]:
np.round(x_train_new.describe(),2)

,RowNumber,CustomerId,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
count,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00,8000.00
mean,0.50,0.50,0.60,0.45,0.28,0.50,0.30,0.18,0.70,0.51,0.50
std,0.29,0.29,0.19,0.50,0.14,0.29,0.25,0.19,0.46,0.50,0.29
min,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,0.25,0.25,0.47,0.00,0.19,0.30,0.00,0.00,0.00,0.00,0.26
50%,0.50,0.50,0.61,0.00,0.26,0.50,0.38,0.00,1.00,1.00,0.50
75%,0.75,0.75,0.74,1.00,0.35,0.70,0.51,0.33,1.00,1.00,0.75
max,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00

## Toyota.csv

In [20]:
df=pd.read_csv("C:\\Users\\HARSHITA\\Downloads\\toyota - toyota.csv")
df.head(2)

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0  GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
1  GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0

In [ ]:
df['model'].value_counts()

In [24]:
df['transmission'].value_counts()

transmission
Manual       3826
Automatic    2657
Semi-Auto     254
Other           1
Name: count, dtype: int64

In [28]:
df=df.drop(columns=['model','fuelType'])

In [25]:
df['transmission']=df['transmission'].map({'Manual':0,'Automatic':1,'Semi-Auto':2,'Other':3})

In [29]:
df.head(2)

   year  price  transmission  mileage  tax   mpg  engineSize
0  2016  16000             0    24089  265  36.2         2.0
1  2017  15995             0    18615  145  36.2         2.0

In [30]:
x=df.drop(columns=['engineSize'])
y=df['engineSize']

In [31]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [32]:
mn=MinMaxScaler()

In [33]:
x_train_mn=mn.fit_transform(x_train)

In [34]:
x_train_new=pd.DataFrame(x_train_mn,columns=[x_train.columns])

## Covid_toy.csv

In [45]:
df=pd.read_csv("C:\\Users\\HARSHITA\\OneDrive\\Documents\\Desktop\\ml\\covid_toy - covid_toy.csv")
df.head(2)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes

In [46]:
df=df.drop(columns=['city','cough'])

In [47]:
df['gender']=df['gender'].map({'Female':1,'Male':0})

In [48]:
df['has_covid']=df['has_covid'].map({'Yes':1,'No':0})

In [49]:
x=df.drop(columns=['has_covid'])
y=df['has_covid']

In [50]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [51]:
mn=MinMaxScaler()

In [52]:
x_train_mn=mn.fit_transform(x_train)

In [53]:
x_train_new=pd.DataFrame(x_train_mn,columns=[x_train.columns])

In [54]:
np.round(x_train_new.describe(),2)

         age gender  fever
count  80.00  80.00  71.00
mean    0.48   0.59   0.50
std     0.31   0.50   0.34
min     0.00   0.00   0.00
25%     0.19   0.00   0.25
50%     0.47   1.00   0.50
75%     0.76   1.00   0.83
max     1.00   1.00   1.00

In [55]:
import seaborn as sns

In [87]:
df=sns.load_dataset('Tips')

In [88]:
df.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [89]:
df=df.drop(columns=['smoker'])

In [90]:
df['sex']=df['sex'].map({'Female':1,'Male':0})

In [91]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [92]:
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [93]:
df['day']=df['day'].map({'Sat':6,'Sun':7,'Thru':4,'Fri':5})

In [94]:
df['time']=df['time'].map({'Dinner':1,'Lunch':0})

In [95]:
df.isnull().sum()

total_bill     0
tip            0
sex            0
day           62
time           0
size           0
dtype: int64

In [96]:
df['day']=df['day'].fillna(df['day'].mean())

In [97]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
day           0
time          0
size          0
dtype: int64

In [98]:
x=df.drop(columns=['total_bill'])
y=df['total_bill']

In [99]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [100]:
mn=MinMaxScaler()

In [101]:
x_train_mn=mn.fit_transform(x_train)

In [102]:
x_train_new=pd.DataFrame(x_train_mn,columns=x_train.columns)

In [103]:
np.round(x_train_new.describe(),2)

          tip     sex     day    time    size
count  195.00  195.00  195.00  195.00  195.00
mean     0.23    0.35    0.65    0.73    0.31
std      0.16    0.48    0.29    0.45    0.19
min      0.00    0.00    0.00    0.00    0.00
25%      0.11    0.00    0.50    0.00    0.20
50%      0.22    0.00    0.66    1.00    0.20
75%      0.30    1.00    1.00    1.00    0.40
max      1.00    1.00    1.00    1.00    1.00